### database (My SQL)

In [ ]:
sql = """
show databases;
"""

In [ ]:
sql = """
create database onlineshop1;
"""

In [ ]:
sql = """
use onlineshop1;
"""

In [ ]:
sql = """
drop database onlineshop1;
"""

In [ ]:
sql = """
create table users (
user_id  int not null  ,
first_name varchar(50) , 
last_name varchar(50)  not null  , 
age int not null , 
primary key (user_id)
);"""

In [ ]:
sql = """
create table orders (
order_id  int not null auto_increment ,
name  varchar(225) , 
ref_user_id  int not null  , 
price  int not null , 
primary key (order_id) , 
foreign key (ref_user_id) references users (user_id)
);"""

In [ ]:
sql = """
show tables;
show fields from users ;"""

In [ ]:
sql = """
insert into users (user_id  , first_name , last_name ,  age )
values (1, "amirhossein" , "ayoubi" , 20),
(2, "taylor" , "swift" , 35) ,
(3, "hande" , "ercel" , 31) ;"""

In [ ]:
sql = """
select * from users ;"""

In [ ]:
sql = """
update users 
set 
age  = age*10 ;"""

In [ ]:
sql ="""
delete  from  users 
where user_id = 1 ;"""

In [ ]:
sql = """
alter table users 
add birthday date ;"""

In [ ]:
sql = """
alter table users 
drop column birthday ; """

In [ ]:
sql = """
alter table users 
modify column  first_name  varchar(250) ;"""

In [ ]:
sql = """
alter table users
change last_name  family_name  varchar(50);"""

In [ ]:
sql = """
alter table users 
rename to users1 ; """

In [ ]:
sql = """
select sum(price) as sum_price from orders 
where name = "laptop" ;"""

In [ ]:
sql = """
select name ,  sum(price) as sum from orders 
group by name ;"""

### example for many to many :

In [ ]:
sql = """
create table users (
user_id  int not null auto_increment  ,
first_name varchar(50) , 
last_name varchar(50)  not null  , 
age int not null , 
primary key (user_id)
);"""

In [ ]:
sql = """
create table orders (
order_id  int not null auto_increment ,
name varchar(50) not null , 
price int not null  ,
primary key (order_id) 
);"""

In [ ]:
sql = """
insert into users (first_name , last_name  , age )
values ("amirhossein" , "ayoubi" , 20),
("taylor" , "swift" , 35),
("hande" , "ercel" , 31),
("selena" , "gomez" , 35),
("ariana" , "grande" , 27);"""

In [ ]:
sql = """
insert into orders (name ,  price )
values ("laptop" , 100000000),
("mose" , 120000),
("keyboard" , 5000000),
("coolpad" , 1100000),
("airpod" , 5500000);"""

In [ ]:
sql = """
create table merger(
merg_id int not null  auto_increment , 
user_id int not null , 
order_id int not null , 
primary key (merg_id) , 
foreign key (user_id) references users (user_id) , 
foreign key (order_id) references orders (order_id)
);
"""

In [ ]:
sql = """
insert into merger (user_id  , order_id )
values (1,4), 
(1,5) , 
(2,1), 
(2,3),
(2,2),
(3,3),
(3,1),
(3,5),
(5,2),
(4,1),
(4,5) ;
"""

In [ ]:
sql = """
select  u.first_name , u.last_name  , o.name , o.price  from merger as m
inner join users as u on  u.user_id = m.user_id
inner join orders as o  on o.order_id = m.order_id 
where o.price > 2000000
;
"""

# ____________________________________________________________________________

### connection to mysql  in python

In [1]:
import mysql.connector

In [2]:
mydb = mysql.connector.connect(
    host  = "localhost", 
    user = "root" ,
    password ="atslover1989"
)

In [3]:
mycursor = mydb.cursor()

In [8]:
sql = "create database db_connection ;"
mycursor.execute (sql)

In [9]:
sql1 = "show databases ;"
mycursor.execute(sql1)
mycursor.fetchall()

[('db_connection',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('shop1',),
 ('sys',)]

In [10]:
mydb1 = mysql.connector.connect(
    host  = "localhost", 
    user = "root" ,
    password  = "atslover1989",
    database = "db_connection"
)

In [11]:
mycursor1 = mydb1.cursor()

In [12]:
sql2 ="""
create table users (
user_id  int not null auto_increment  ,
first_name varchar(50) , 
last_name varchar(50)  not null  , 
age int not null , 
primary key (user_id)
);"""

In [14]:
try:
    mycursor1.execute(sql2)
except Exception as e  :
    print(e)

1050 (42S01): Table 'users' already exists

In [15]:
sql3 = "show tables;"
mycursor1.execute(sql3)
mycursor1.fetchall()

[('users',)]

In [16]:
sql4  = """
insert into users ( first_name , last_name ,  age )
values ( "amirhossein" , "ayoubi" , 20),
( "taylor" , "swift" , 35) ,
( "hande" , "ercel" , 31) ;"""

In [17]:
mycursor1.execute(sql4)

In [ ]:
mydb1.commit()  ### for saving in database we have to do this !!!

In [18]:
sql3 = "select * from users ;"
mycursor1.execute(sql3)
mycursor1.fetchall()

[(1, 'amirhossein', 'ayoubi', 20),
 (2, 'taylor', 'swift', 35),
 (3, 'hande', 'ercel', 31)]